[{"model": "stories.stories", "pk": 1, "fields": {"category": 4, "code": "neo Advance", "name": "Alfie Willis & Alana Haine", "size": "527mm x 958mm", "description": "We Wanted to source a roof window that would not sit too proud of the new copper roof, not realizing that he could infact specify a roof window that would sit completely flush with the roof material.\r\n\r\nWe both work from home and wanted to maximise the light in out loft conversion, these rooflights are just the job.", "price": "685.00", "rating": "5.00", "image_url": null, "image": "neo1_s75cBSX.jpg"}}, {"model": "stories.stories", "pk": 2, "fields": {"category": 1, "code": "The Conservation Rooflight", "name": "Lisa Frost", "size": "600mm x 900mm", "description": "I tasked award-winning architect Peter Williams with the refurbishment of my former Victorian Coach House. The brief was to maximise light into the hall and open stairwell whilst taking into account the original oak beams which gives the Coach House much of its character.\r\n\r\nI am located in an area with strict planning regulations, Peter also knew that the specified Rooflight system would need to appease the Planning Officer.\r\n\r\nExternally, the low-profile frame of the Conservation Rooflights meant that the rooflight did not detract in any way away from the original building, thus conforming to the strict planning regulations.\r\n\r\nI couldn't be happier with the result and I am so please I went with the Rooflight Company and their Conservation Rooflight.", "price": "1589.00", "rating": "5.00", "image_url": null, "image": "cr2_2fubpvg.jpg"}}, {"model": "stories.stories", "pk": 3, "fields": {"category": 1, "code": "The Conservation Rooflight", "name": "Dan Abrams", "size": "900mm x 500mm", "description": "Dan Abrams wanted to maximise the living space of his bungalow by adding three bedrooms and two bathrooms as part of a large renovation project. However, her bungalow is located in the heart of the Henley-on-Thames Conservation Area, resulting in it being subject to planning restrictions.\r\n\r\nThese restrictions meant she was unable to build upwards to create a second storey, so instead she turned to adding the bedrooms and bathrooms to the eaves of the property. This savvy approach would reduce the need for planning permission. Time-consuming, expensive, and intense structural work would not be needed either.\r\n\r\nDan worked with an architect to perfect the design, resulting in the new rooms benefitting from maximum levels of natural light. This was particularly important as one of the newly created bedrooms, and both bathrooms, would have no access to vertical windows.", "price": "5600.00", "rating": "5.00", "image_url": null, "image": "cr3_N0CGKKg.jpg"}}, {"model": "stories.stories", "pk": 4, "fields": {"category": 2, "code": "the Conservation Plateau Rooflight", "name": "Melanie Watts", "size": "900mm x 300mm", "description": "Our property is homed in what was an 18th Century Grade 1 listed Mansion set in 110 acres of historic landscape in Norwich. The watts estates team was briefed to develop what was once an open courtyard into a covered space, for use as an overspill area for dining facilities, assemblies and event. This area had to be developed without lessening the impact of the beautiful Grade 1 listed historic setting.\r\n\r\nI am delighted with the quality of the windows. I spoke with the sales team several times in relation to the order off the windows and electric window blinds. They were extremely helpful and courteous throughout.\r\n\r\nNow that the windows are fitted, I am delighted with them. I wouldn’t hesitate in recommending The Rooflight Company to others.", "price": "658.00", "rating": "4.00", "image_url": null, "image": "crplat1_02HZ3b7.jpg"}}, {"model": "stories.stories", "pk": 5, "fields": {"category": 3, "code": "neo Rooflight", "name": "Phil Burbage", "size": "780mm x 560mm", "description": "When we decided to convert our loft space into a master bedroom and bathroom they faced many challenges. We knew that because of our young family all the work had to be carried out whilst they remained in the house, so needed as little disruption to their daily lives as possible.\r\n\r\nWorking with our builder, we wanted to make as much use of his loft space as possible. The steep eaves of the roof would limit head space, and being too able to walk around the new bedroom without facing obstacles was an important part of the brief.\r\n\r\nSpecified for the scheme were six neo® roof windows. Four would sit either side of the eaves in the new master bedroom, the fifth would go in the new bathroom, which is now my wife favorite room in the house.\r\n\r\nWith head space continually the focus of the project, a top-hung roof window solution was decided upon as it would mean when open the rooflight would not encroach into the room.\r\n\r\nFive of the rooflights have been installed with the manual handle opening option and dual pleated blinds whilst the largest rooflight was specified as fixed shut.", "price": "6745.00", "rating": "4.00", "image_url": null, "image": "neo2_pdY6ife.jpg"}}, {"model": "stories.stories", "pk": 6, "fields": {"category": 4, "code": "neo Advance", "name": "Angel Willis", "size": "980mm x60mm", "description": "Privacy was a key element for me as my property is flanked at either side by homes overlooking the extension. With this in mind the glazing was upgraded to Optifloat Opal privacy glass.\r\n\r\nThree neo Advance®  roof windows were specified, two being motorised and one fixed. The motorised roof windows were fitted with rain sensors to ensure automatic closure during bad weather conditions.\r\n\r\nUnlike most modern roof windows, neo Advance® when closed has totally clear views uncluttered by opening mechanisms. All neo Advance® models are top-hinged with concealed motors or with a discreet handle at the cill should a manual option be desired. \r\n\r\nThis rooflight is sleek, high end and I couldn't be happier with the aesthetics.", "price": "680.00", "rating": "5.00", "image_url": null, "image": "neoa2_oSrdDjL.jpg"}}, {"model": "stories.stories", "pk": 7, "fields": {"category": 4, "code": "neo Advance", "name": "Sarah Trueman", "size": "965mm x387mm", "description": "Our Farmhouse and Barns are Grade II Listed farmhouse situated on the South Coast.  \r\n\r\nWorking closely with architect, Charlie Luxton, I explored a range of rooflight  options including patent glazing and conservation rooflights but in the end decided to specify neo Advance® as this meant a single roof window, in various sizes, could be installed to meet the design requirements.\r\n\r\nThe roof has been reconstructed and finished with standing seam zinc. Both Charlie and I felt it was important the roof windows would sit flush with the roof line to provide a seamless, unbroken appearance.\r\n\r\nWith nearly thirty rooflights on the scheme, the Rooflight Company in-house design team worked with the roofing contractors to make sure the installation into the zinc roof would be effortless.\r\n\r\nIn total 28 neo Advance® roof windows in two different sizes were specified with a mixtue of manual and cill motorised opening and blinds in varying styles and sizes.", "price": "1560.00", "rating": "5.00", "image_url": null, "image": "neoa1_RCX7f74.jpg"}}, {"model": "stories.stories", "pk": 8, "fields": {"category": 1, "code": "neo Rooflight", "name": "Nick Cockayne", "size": "687mm x 560mm", "description": "Conservation Rooflights were specified for the conversion of our oak-framed Listed barn which dates back to the 17th century.\r\n\r\nAs this is a National Trust property is a good example of the use of Conservation Rooflights in a rural environment. \r\n\r\nOnce our extension was complete we wanted to have roof windows to not only match the theme of our property but comply with building regs. The Rooflight Companies windows do just that.", "price": "3658.00", "rating": "5.00", "image_url": null, "image": "cr1.jpg"}}]